#ifndef _BSP_24CXX_H
#define _BSP_24CXX_H
#include "sys.h"
#include "bsp_myiic.h"

/*共用体 浮点数*/
typedef union
{
  uint8_t byte[4];
  float data;
} float_data_t;

/*共用体 整数*/
typedef union
{
  uint8_t byte[4];
  float data;
} int_data_t;

#define AT24C01 127
#define AT24C02 255
#define AT24C04 511
#define AT24C08 1023
#define AT24C16 2047
#define AT24C32 4095
#define AT24C64 8191
#define AT24C128 16383
#define AT24C256 32767
/*宏定义AT24CXX的芯片型号*/
#define EE_TYPE AT24C128
/*
*********************************************************************************************************
*   函 数 名: AT24CXX_ReadOneByte
*   功能说明: 指定地址读取一个字节数据
*   形    参: ReadAddr:读取地址
*   返 回 值: u8:读到的数据
*********************************************************************************************************
*/
u8 AT24CXX_ReadOneByte(u16 ReadAddr); 

/*
*   函 数 名: AT24CXX_WriteOneByte
*   功能说明: 指定地址写入一个字节数据
*   形    参: WriteAddr:读取地址 DataToWrite:写入数据
*   返 回 值: 无
*********************************************************************************************************
*/                       
void AT24CXX_WriteOneByte(u16 WriteAddr, u8 DataToWrite); 

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_WriteLenByte
*   功能说明: 在AT24CXX里面的指定地址开始写入长度为Len的数据
*   形    参: WriteAddr:开始写入的地址 DataToWrite:数据数组首地址 Len:要写入数据的长度
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_WriteLenByte(u16 WriteAddr, u32 DataToWrite, u8 Len);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_ReadLenByte
*   功能说明: 在AT24CXX里面的指定地址开始读出长度为Len的数据,该函数用于读出16bit或者32bit的数据
*   形    参: ReadAddr:开始读出的地址 Len:要读出数据的长度2,4
*   返 回 值: 读取到的数据
*********************************************************************************************************
*/
u32 AT24CXX_ReadLenByte(u16 ReadAddr, u8 Len);       

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Read
*   功能说明: 在AT24CXX里面的指定地址开始读出指定个数的数据
*   形    参: ReadAddr:开始读出的地址 pBuffer:数据数组首地址 NumToRead:要读出数据的个数
*   返 回 值: 无
*********************************************************************************************************
*/   
void AT24CXX_Read(u16 ReadAddr, u8 *pBuffer, u16 NumToRead); 

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Write
*   功能说明: 在AT24CXX里面的指定地址开始写入指定个数的数据
*   形    参: ReadAddr:开始写入的地址 pBuffer:数据数组首地址 NumToRead:要写入数据的个数
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_Write(u16 WriteAddr, u8 *pBuffer, u16 NumToWrite);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_ReadString
*   功能说明: 在AT24CXX里面的指定地址开始读取指定个数的字符串数据
*   形    参: ReadAddr:开始读取的地址 pBuffer:数据数组首地址 NumToRead:要读取数据的个数
*   返 回 值: 无
*********************************************************************************************************
*/               
void AT24CXX_ReadString(uint16_t ReadAddr, char *buffer, uint16_t maxLength);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_WriteString
*   功能说明: 在AT24CXX里面的指定地址开始写入字符串数据
*   形    参: ReadAddr:开始读取的地址 str:要写入的字符串
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_WriteString(uint16_t WriteAddr, const char *str); 

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Write_Float_Num
*   功能说明: 在AT24CXX里面的指定地址开始写入指定的浮点数据
*   形    参: ReadAddr:开始读取的地址 data:要写入的浮点数据
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_Write_Float_Num(uint16_t WriteAddr, float data);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Read_Float_Num
*   功能说明: 在AT24CXX里面的指定地址开始读取指定的浮点数据
*   形    参: ReadAddr:开始读取的地址
*   返 回 值: 无
*********************************************************************************************************
*/
float AT24CXX_Read_Float_Num(uint16_t ReadAddr);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Write_Int_Num
*   功能说明: 在AT24CXX里面的指定地址开始写入指定的整型数据
*   形    参: ReadAddr:开始读取的地址 data:要写入的整型数据
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_Write_Int_Num(uint16_t WriteAddr, int data);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Read_Int_Num
*   功能说明: 在AT24CXX里面的指定地址开始读取指定的整型数据
*   形    参: ReadAddr:开始读取的地址
*   返 回 值: 无
*********************************************************************************************************
*/
int AT24CXX_Read_Int_Num(uint16_t ReadAddr);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Write_Short_Int_Num
*   功能说明: 在AT24CXX里面的指定地址开始写入指定的短整型数据
*   形    参: ReadAddr:开始读取的地址 data:要写入的短整型数据
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_Write_Short_Int_Num(uint16_t WriteAddr, int16_t data);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Read_Short_Int_Num
*   功能说明: 在AT24CXX里面的指定地址开始读取指定的短整型数据
*   形    参: ReadAddr:开始读取的地址
*   返 回 值: 无
*********************************************************************************************************
*/
int16_t AT24CXX_Read_Short_Int_Num(uint16_t ReadAddr);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Check
*   功能说明: 检查AT24CXX是否正常,通过写入最后一个地址的内容来判断(使用其他的型号记得修改)
*   形    参: 无
*   返 回 值: 1:检测失败 0:检测成功
*********************************************************************************************************
*/
u8 AT24CXX_Check(void);

/*
*********************************************************************************************************
*   函 数 名: AT24CXX_Init
*   功能说明: AT24CXX模块初始化
*   形    参: 无
*   返 回 值: 无
*********************************************************************************************************
*/
void AT24CXX_Init(void); 
#endif /*_BSP_24CXX_H */
